app/controllers/users_controller.rb

INSERT INTO "users" ("email", "full_name", "password_digest", "address_line1", "address_line2", "number", "zipcode", "city", "state", "cellphone", "created_at", "updated_at", "confirmation_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 15]]
UPDATE "users" SET "full_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "sapowww"], ["password_digest", "$2a$10$xOhfgHn9Sq94A3TQTNz9tewRktE2Df9CBCgfY2Th3Xv6wTfNclVz."], ["updated_at", "2015-06-11 20:25:55.024806"], ["id", 15]]
---
	def update
	  @user = User.find(params[:id])
	  if @user.update(user_params)